## Plan Result (1112: sbox_aria - Terraform Plan Apply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 0 to change, 24 to destroy.</code></pre>

* Create
  * local_file.config[&#34;00&#34;]
  * local_file.config[&#34;01&#34;]
  * local_file.config[&#34;02&#34;]
* Delete
  * azurerm_linux_function_app.example[&#34;00-af-aplfpa&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-aplfta&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-apluta&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-bails&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-joh&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-sbails&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-td&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-aplfpa&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-aplfta&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-apluta&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-bails&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-joh&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-sbails&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-td&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-aplfpa&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-aplfta&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-apluta&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-bails&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-joh&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-sbails&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-td&#34;]
  * azurerm_storage_account.zcutting[&#34;00&#34;]
  * azurerm_storage_account.zcutting[&#34;01&#34;]
  * azurerm_storage_account.zcutting[&#34;02&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_linux_function_app.example["00-af-aplfpa"] will be destroyed
  # (because azurerm_linux_function_app.example is not in configuration)
  - resource "azurerm_linux_function_app" "example" {
      - app_settings                                   = {
          - "AzureWebJobsFeatureFlags"                              = "EnableWorkerIndexing"
          - "ENABLE_ORYX_BUILD"                                     = "true"
          - "ENVIRONMENT"                                           = "sbox"
          - "FUNCTIONS_WORKER_RUNTIME"                              = "python"
          - "LZ_KEY"                                                = "00"
          - "PYTHON_ENABLE_WORKER_EXTENSIONS"                       = "1"
          - "SCM_DO_BUILD_DURING_DEPLOYMENT"                        = "1"
          - "sboxdlrmeventhubns_RootManageSharedAccessKey_EVENTHUB" = (sensitive value)
        } -> null
      - builtin_logging_enabled                        = true -> null
      - client_certificate_enabled                     = false -> null
      - client_certificate_mode                        = "Optional" -> null
      - content_share_force_disabled                   = false -> null
      - custom_domain_verification_id                  = (sensitive value) -> null
      - daily_memory_time_quota                        = 0 -> null
      - default_hostname                               = "af-aplfpa-sbox00-uks-dlrm-01.azurewebsites.net" -> null
      - enabled                                        = true -> null
      - ftp_publish_basic_authentication_enabled       = true -> null
      - functions_extension_version                    = "~4" -> null
      - https_only                                     = false -> null
      - id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/af-aplfpa-sbox00-uks-dlrm-01" -> null
      - key_vault_reference_identity_id                = "SystemAssigned" -> null
      - kind                                           = "functionapp,linux" -> null
      - location                                       = "uksouth" -> null
      - name                                           = "af-aplfpa-sbox00-uks-dlrm-01" -> null
      - outbound_ip_address_list                       = [
          - "51.140.177.236",
          - "51.140.46.202",
          - "51.140.84.145",
        ] -> null
      - outbound_ip_addresses                          = "51.140.177.236,51.140.46.202,51.140.84.145" -> null
      - possible_outbound_ip_address_list              = [
          - "51.140.60.161",
          - "51.140.61.32",
          - "51.140.68.240",
          - "51.140.64.162",
          - "51.140.177.236",
          - "51.140.46.202",
          - "51.132.208.31",
          - "20.49.154.81",
          - "20.77.142.8",
          - "20.77.142.177",
          - "20.77.143.19",
          - "20.77.143.34",
          - "20.108.90.121",
          - "20.117.217.212",
          - "20.26.58.21",
          - "20.26.60.2",
          - "20.26.60.196",
          - "20.26.60.226",
          - "51.140.84.145",
        ] -> null
      - possible_outbound_ip_addresses                 = "51.140.60.161,51.140.61.32,51.140.68.240,51.140.64.162,51.140.177.236,51.140.46.202,51.132.208.31,20.49.154.81,20.77.142.8,20.77.142.177,20.77.143.19,20.77.143.34,20.108.90.121,20.117.217.212,20.26.58.21,20.26.60.2,20.26.60.196,20.26.60.226,51.140.84.145" -> null
      - public_network_access_enabled                  = true -> null
      - resource_group_name                            = "ingest00-main-sbox" -> null
      - service_plan_id                                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/serverFarms/af-aplfpa-sbox00-uks-dlrm-01" -> null
      - site_credential                                = (sensitive value) -> null
      - storage_account_access_key                     = (sensitive value) -> null
      - storage_account_name                           = "ingest00zcuttingsbox" -> null
      - storage_uses_managed_identity                  = false -> null
      - tags                                           = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> null
      - virtual_network_backup_restore_enabled         = false -> null
      - virtual_network_subnet_id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-product-001-sbox" -> null
      - vnet_image_pull_enabled                        = false -> null
      - webdeploy_publish_basic_authentication_enabled = true -> null
        # (4 unchanged attributes hidden)

      - site_config {
          - always_on                                     = true -> null
          - app_scale_limit                               = 0 -> null
          - application_insights_connection_string        = (sensitive value) -> null
          - container_registry_use_managed_identity       = false -> null
          - default_documents                             = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
            ] -> null
          - detailed_error_logging_enabled                = false -> null
          - elastic_instance_minimum                      = 1 -> null
          - ftps_state                                    = "Disabled" -> null
          - health_check_eviction_time_in_min             = 0 -> null
          - http2_enabled                                 = false -> null
          - ip_restriction_default_action                 = "Allow" -> null
          - linux_fx_version                              = "PYTHON|3.11" -> null
          - load_balancing_mode                           = "LeastRequests" -> null
          - managed_pipeline_mode                         = "Integrated" -> null
          - minimum_tls_version                           = "1.2" -> null
          - pre_warmed_instance_count                     = 0 -> null
          - remote_debugging_enabled                      = false -> null
          - remote_debugging_version                      = "VS2022" -> null
          - runtime_scale_monitoring_enabled              = false -> null
          - scm_ip_restriction_default_action             = "Allow" -> null
          - scm_minimum_tls_version                       = "1.2" -> null
          - scm_type                                      = "VSTSRM" -> null
          - scm_use_main_ip_restriction                   = false -> null
          - use_32_bit_worker                             = false -> null
          - vnet_route_all_enabled                        = false -> null
          - websockets_enabled                            = false -> null
          - worker_count                                  = 1 -> null
            # (6 unchanged attributes hidden)

          - application_stack {
              - python_version              = "3.11" -> null
              - use_custom_runtime          = false -> null
              - use_dotnet_isolated_runtime = false -> null
                # (4 unchanged attributes hidden)
            }
        }
    }

  # azurerm_linux_function_app.example["00-af-aplfta"] will be destroyed
  # (because azurerm_linux_function_app.example is not in configuration)
  - resource "azurerm_linux_function_app" "example" {
      - app_settings                                   = {
          - "AzureWebJobsFeatureFlags"                              = "EnableWorkerIndexing"
          - "ENABLE_ORYX_BUILD"                                     = "true"
          - "ENVIRONMENT"                                           = "sbox"
          - "FUNCTIONS_WORKER_RUNTIME"                              = "python"
          - "LZ_KEY"                                                = "00"
          - "PYTHON_ENABLE_WORKER_EXTENSIONS"                       = "1"
          - "SCM_DO_BUILD_DURING_DEPLOYMENT"                        = "1"
          - "sboxdlrmeventhubns_RootManageSharedAccessKey_EVENTHUB" = (sensitive value)
        } -> null
      - builtin_logging_enabled                        = true -> null
      - client_certificate_enabled                     = false -> null
      - client_certificate_mode                        = "Optional" -> null
      - content_share_force_disabled                   = false -> null
      - custom_domain_verification_id                  = (sensitive value) -> null
      - daily_memory_time_quota                        = 0 -> null
      - default_hostname                               = "af-aplfta-sbox00-uks-dlrm-01.azurewebsites.net" -> null
      - enabled                                        = true -> null
      - ftp_publish_basic_authentication_enabled       = true -> null
      - functions_extension_version                    = "~4" -> null
      - https_only                                     = false -> null
      - id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/af-aplfta-sbox00-uks-dlrm-01" -> null
      - key_vault_reference_identity_id                = "SystemAssigned" -> null
      - kind                                           = "functionapp,linux" -> null
      - location                                       = "uksouth" -> null
      - name                                           = "af-aplfta-sbox00-uks-dlrm-01" -> null
      - outbound_ip_address_list                       = [
          - "51.140.177.236",
          - "51.140.46.202",
          - "51.140.84.145",
        ] -> null
      - outbound_ip_addresses                          = "51.140.177.236,51.140.46.202,51.140.84.145" -> null
      - possible_outbound_ip_address_list              = [
          - "51.140.60.161",
          - "51.140.61.32",
          - "51.140.68.240",
          - "51.140.64.162",
          - "51.140.177.236",
          - "51.140.46.202",
          - "51.132.208.31",
          - "20.49.154.81",
          - "20.77.142.8",
          - "20.77.142.177",
          - "20.77.143.19",
          - "20.77.143.34",
          - "20.108.90.121",
          - "20.117.217.212",
          - "20.26.58.21",
          - "20.26.60.2",
          - "20.26.60.196",
          - "20.26.60.226",
          - "51.140.84.145",
        ] -> null
      - possible_outbound_ip_addresses                 = "51.140.60.161,51.140.61.32,51.140.68.240,51.140.64.162,51.140.177.236,51.140.46.202,51.132.208.31,20.49.154.81,20.77.142.8,20.77.142.177,20.77.143.19,20.77.143.34,20.108.90.121,20.117.217.212,20.26.58.21,20.26.60.2,20.26.60.196,20.26.60.226,51.140.84.145" -> null
      - public_network_access_enabled                  = true -> null
      - resource_group_name                            = "ingest00-main-sbox" -> null
      - service_plan_id                                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/serverFarms/af-aplfta-sbox00-uks-dlrm-01" -> null
      - site_credential                                = (sensitive value) -> null
      - storage_account_access_key                     = (sensitive value) -> null
      - storage_account_name                           = "ingest00zcuttingsbox" -> null
      - storage_uses_managed_identity                  = false -> null
      - tags                                           = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> null
      - virtual_network_backup_restore_enabled         = false -> null
      - virtual_network_subnet_id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-product-001-sbox" -> null
      - vnet_image_pull_enabled                        = false -> null
      - webdeploy_publish_basic_authentication_enabled = true -> null
        # (4 unchanged attributes hidden)

      - site_config {
          - always_on                                     = true -> null
          - app_scale_limit                               = 0 -> null
          - application_insights_connection_string        = (sensitive value) -> null
          - container_registry_use_managed_identity       = false -> null
          - default_documents                             = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
            ] -> null
          - detailed_error_logging_enabled                = false -> null
          - elastic_instance_minimum                      = 1 -> null
          - ftps_state                                    = "Disabled" -> null
          - health_check_eviction_time_in_min             = 0 -> null
          - http2_enabled                                 = false -> null
          - ip_restriction_default_action                 = "Allow" -> null
          - linux_fx_version                              = "PYTHON|3.11" -> null
          - load_balancing_mode                           = "LeastRequests" -> null
          - managed_pipeline_mode                         = "Integrated" -> null
          - minimum_tls_version                           = "1.2" -> null
          - pre_warmed_instance_count                     = 0 -> null
          - remote_debugging_enabled                      = false -> null
          - remote_debugging_version                      = "VS2022" -> null
          - runtime_scale_monitoring_enabled              = false -> null
          - scm_ip_restriction_default_action             = "Allow" -> null
          - scm_minimum_tls_version                       = "1.2" -> null
          - scm_type                                      = "VSTSRM" -> null
          - scm_use_main_ip_restriction                   = false -> null
          - use_32_bit_worker                             = false -> null
          - vnet_route_all_enabled                        = false -> null
          - websockets_enabled                            = false -> null
          - worker_count                                  = 1 -> null
            # (6 unchanged attributes hidden)

          - application_stack {
              - python_version              = "3.11" -> null
              - use_custom_runtime          = false -> null
              - use_dotnet_isolated_runtime = false -> null
                # (4 unchanged attributes hidden)
            }
        }
    }

  # azurerm_linux_function_app.example["00-af-apluta"] will be destroyed
  # (because azurerm_linux_function_app.example is not in configuration)
  - resource "azurerm_linux_function_app" "example" {
      - app_settings                                   = {
          - "AzureWebJobsFeatureFlags"                              = "EnableWorkerIndexing"
          - "ENABLE_ORYX_BUILD"                                     = "true"
          - "ENVIRONMENT"                                           = "sbox"
          - "FUNCTIONS_WORKER_RUNTIME"                              = "python"
          - "LZ_KEY"                                                = "00"
          - "PYTHON_ENABLE_WORKER_EXTENSIONS"                       = "1"
          - "SCM_DO_BUILD_DURING_DEPLOYMENT"                        = "1"
          - "sboxdlrmeventhubns_RootManageSharedAccessKey_EVENTHUB" = (sensitive value)
        } -> null
      - builtin_logging_enabled                        = true -> null
      - client_certificate_enabled                     = false -> null
      - client_certificate_mode                        = "Optional" -> null
      - content_share_force_disabled                   = false -> null
      - custom_domain_verification_id                  = (sensitive value) -> null
      - daily_memory_time_quota                        = 0 -> null
      - default_hostname                               = "af-apluta-sbox00-uks-dlrm-01.azurewebsites.net" -> null
      - enabled                                        = true -> null
      - ftp_publish_basic_authentication_enabled       = true -> null
      - functions_extension_version                    = "~4" -> null
      - https_only                                     = false -> null
      - id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/af-apluta-sbox00-uks-dlrm-01" -> null
      - key_vault_reference_identity_id                = "SystemAssigned" -> null
      - kind                                           = "functionapp,linux" -> null
      - location                                       = "uksouth" -> null
      - name                                           = "af-apluta-sbox00-uks-dlrm-01" -> null
      - outbound_ip_address_list                       = [
          - "51.140.177.236",
          - "51.140.46.202",
          - "51.140.84.145",
        ] -> null
      - outbound_ip_addresses                          = "51.140.177.236,51.140.46.202,51.140.84.145" -> null
      - possible_outbound_ip_address_list              = [
          - "51.140.60.161",
          - "51.140.61.32",
          - "51.140.68.240",
          - "51.140.64.162",
          - "51.140.177.236",
          - "51.140.46.202",
          - "51.132.208.31",
          - "20.49.154.81",
          - "20.77.142.8",
          - "20.77.142.177",
          - "20.77.143.19",
          - "20.77.143.34",
          - "20.108.90.121",
          - "20.117.217.212",
          - "20.26.58.21",
          - "20.26.60.2",
          - "20.26.60.196",
          - "20.26.60.226",
          - "51.140.84.145",
        ] -> null
      - possible_outbound_ip_addresses                 = "51.140.60.161,51.140.61.32,51.140.68.240,51.140.64.162,51.140.177.236,51.140.46.202,51.132.208.31,20.49.154.81,20.77.142.8,20.77.142.177,20.77.143.19,20.77.143.34,20.108.90.121,20.117.217.212,20.26.58.21,20.26.60.2,20.26.60.196,20.26.60.226,51.140.84.145" -> null
      - public_network_access_enabled                  = true -> null
      - resource_group_name                            = "ingest00-main-sbox" -> null
      - service_plan_id                                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/serverFarms/af-apluta-sbox00-uks-dlrm-01" -> null
      - site_credential                                = (sensitive value) -> null
      - storage_account_access_key                     = (sensitive value) -> null
      - storage_account_name                           = "ingest00zcuttingsbox" -> null
      - storage_uses_managed_identity                  = false -> null
      - tags                                           = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> null
      - virt

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

4 unchanged attributes hidden)

      - site_config {
          - always_on                                     = true -> null
          - app_scale_limit                               = 0 -> null
          - application_insights_connection_string        = (sensitive value) -> null
          - container_registry_use_managed_identity       = false -> null
          - default_documents                             = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
            ] -> null
          - detailed_error_logging_enabled                = false -> null
          - elastic_instance_minimum                      = 1 -> null
          - ftps_state                                    = "Disabled" -> null
          - health_check_eviction_time_in_min             = 0 -> null
          - http2_enabled                                 = false -> null
          - ip_restriction_default_action                 = "Allow" -> null
          - linux_fx_version                              = "PYTHON|3.11" -> null
          - load_balancing_mode                           = "LeastRequests" -> null
          - managed_pipeline_mode                         = "Integrated" -> null
          - minimum_tls_version                           = "1.2" -> null
          - pre_warmed_instance_count                     = 0 -> null
          - remote_debugging_enabled                      = false -> null
          - remote_debugging_version                      = "VS2022" -> null
          - runtime_scale_monitoring_enabled              = false -> null
          - scm_ip_restriction_default_action             = "Allow" -> null
          - scm_minimum_tls_version                       = "1.2" -> null
          - scm_type                                      = "VSTSRM" -> null
          - scm_use_main_ip_restriction                   = false -> null
          - use_32_bit_worker                             = false -> null
          - vnet_route_all_enabled                        = false -> null
          - websockets_enabled                            = false -> null
          - worker_count                                  = 1 -> null
            # (6 unchanged attributes hidden)

          - application_stack {
              - python_version              = "3.11" -> null
              - use_custom_runtime          = false -> null
              - use_dotnet_isolated_runtime = false -> null
                # (4 unchanged attributes hidden)
            }
        }
    }

  # azurerm_storage_account.zcutting["00"] will be destroyed
  # (because azurerm_storage_account.zcutting is not in configuration)
  - resource "azurerm_storage_account" "zcutting" {
      - access_tier                        = "Hot" -> null
      - account_kind                       = "StorageV2" -> null
      - account_replication_type           = "LRS" -> null
      - account_tier                       = "Standard" -> null
      - allow_nested_items_to_be_public    = true -> null
      - cross_tenant_replication_enabled   = false -> null
      - default_to_oauth_authentication    = false -> null
      - dns_endpoint_type                  = "Standard" -> null
      - https_traffic_only_enabled         = true -> null
      - id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest00zcuttingsbox" -> null
      - infrastructure_encryption_enabled  = false -> null
      - is_hns_enabled                     = false -> null
      - large_file_share_enabled           = false -> null
      - local_user_enabled                 = true -> null
      - location                           = "uksouth" -> null
      - min_tls_version                    = "TLS1_2" -> null
      - name                               = "ingest00zcuttingsbox" -> null
      - nfsv3_enabled                      = false -> null
      - primary_access_key                 = (sensitive value) -> null
      - primary_blob_connection_string     = (sensitive value) -> null
      - primary_blob_endpoint              = "https://ingest00zcuttingsbox.blob.core.windows.net/" -> null
      - primary_blob_host                  = "ingest00zcuttingsbox.blob.core.windows.net" -> null
      - primary_connection_string          = (sensitive value) -> null
      - primary_dfs_endpoint               = "https://ingest00zcuttingsbox.dfs.core.windows.net/" -> null
      - primary_dfs_host                   = "ingest00zcuttingsbox.dfs.core.windows.net" -> null
      - primary_file_endpoint              = "https://ingest00zcuttingsbox.file.core.windows.net/" -> null
      - primary_file_host                  = "ingest00zcuttingsbox.file.core.windows.net" -> null
      - primary_location                   = "uksouth" -> null
      - primary_queue_endpoint             = "https://ingest00zcuttingsbox.queue.core.windows.net/" -> null
      - primary_queue_host                 = "ingest00zcuttingsbox.queue.core.windows.net" -> null
      - primary_table_endpoint             = "https://ingest00zcuttingsbox.table.core.windows.net/" -> null
      - primary_table_host                 = "ingest00zcuttingsbox.table.core.windows.net" -> null
      - primary_web_endpoint               = "https://ingest00zcuttingsbox.z33.web.core.windows.net/" -> null
      - primary_web_host                   = "ingest00zcuttingsbox.z33.web.core.windows.net" -> null
      - public_network_access_enabled      = true -> null
      - queue_encryption_key_type          = "Service" -> null
      - resource_group_name                = "ingest00-main-sbox" -> null
      - secondary_access_key               = (sensitive value) -> null
      - secondary_connection_string        = (sensitive value) -> null
      - sftp_enabled                       = false -> null
      - shared_access_key_enabled          = true -> null
      - table_encryption_key_type          = "Service" -> null
      - tags                               = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "environment"  = "sandbox"
        } -> null
        # (56 unchanged attributes hidden)

      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
            # (1 unchanged attribute hidden)
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }
    }

  # azurerm_storage_account.zcutting["01"] will be destroyed
  # (because azurerm_storage_account.zcutting is not in configuration)
  - resource "azurerm_storage_account" "zcutting" {
      - access_tier                        = "Hot" -> null
      - account_kind                       = "StorageV2" -> null
      - account_replication_type           = "LRS" -> null
      - account_tier                       = "Standard" -> null
      - allow_nested_items_to_be_public    = true -> null
      - cross_tenant_replication_enabled   = false -> null
      - default_to_oauth_authentication    = false -> null
      - dns_endpoint_type                  = "Standard" -> null
      - https_traffic_only_enabled         = true -> null
      - id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest01zcuttingsbox" -> null
      - infrastructure_encryption_enabled  = false -> null
      - is_hns_enabled                     = false -> null
      - large_file_share_enabled           = false -> null
      - local_user_enabled                 = true -> null
      - location                           = "uksouth" -> null
      - min_tls_version                    = "TLS1_2" -> null
      - name                               = "ingest01zcuttingsbox" -> null
      - nfsv3_enabled                      = false -> null
      - primary_access_key                 = (sensitive value) -> null
      - primary_blob_connection_string     = (sensitive value) -> null
      - primary_blob_endpoint              = "https://ingest01zcuttingsbox.blob.core.windows.net/" -> null
      - primary_blob_host                  = "ingest01zcuttingsbox.blob.core.windows.net" -> null
      - primary_connection_string          = (sensitive value) -> null
      - primary_dfs_endpoint               = "https://ingest01zcuttingsbox.dfs.core.windows.net/" -> null
      - primary_dfs_host                   = "ingest01zcuttingsbox.dfs.core.windows.net" -> null
      - primary_file_endpoint              = "https://ingest01zcuttingsbox.file.core.windows.net/" -> null
      - primary_file_host                  = "ingest01zcuttingsbox.file.core.windows.net" -> null
      - primary_location                   = "uksouth" -> null
      - primary_queue_endpoint             = "https://ingest01zcuttingsbox.queue.core.windows.net/" -> null
      - primary_queue_host                 = "ingest01zcuttingsbox.queue.core.windows.net" -> null
      - primary_table_endpoint             = "https://ingest01zcuttingsbox.table.core.windows.net/" -> null
      - primary_table_host                 = "ingest01zcuttingsbox.table.core.windows.net" -> null
      - primary_web_endpoint               = "https://ingest01zcuttingsbox.z33.web.core.windows.net/" -> null
      - primary_web_host                   = "ingest01zcuttingsbox.z33.web.core.windows.net" -> null
      - public_network_access_enabled      = true -> null
      - queue_encryption_key_type          = "Service" -> null
      - resource_group_name                = "ingest01-main-sbox" -> null
      - secondary_access_key               = (sensitive value) -> null
      - secondary_connection_string        = (sensitive value) -> null
      - sftp_enabled                       = false -> null
      - shared_access_key_enabled          = true -> null
      - table_encryption_key_type          = "Service" -> null
      - tags                               = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "environment"  = "sandbox"
        } -> null
        # (56 unchanged attributes hidden)

      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
            # (1 unchanged attribute hidden)
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }
    }

  # azurerm_storage_account.zcutting["02"] will be destroyed
  # (because azurerm_storage_account.zcutting is not in configuration)
  - resource "azurerm_storage_account" "zcutting" {
      - access_tier                        = "Hot" -> null
      - account_kind                       = "StorageV2" -> null
      - account_replication_type           = "LRS" -> null
      - account_tier                       = "Standard" -> null
      - allow_nested_items_to_be_public    = true -> null
      - cross_tenant_replication_enabled   = false -> null
      - default_to_oauth_authentication    = false -> null
      - dns_endpoint_type                  = "Standard" -> null
      - https_traffic_only_enabled         = true -> null
      - id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest02zcuttingsbox" -> null
      - infrastructure_encryption_enabled  = false -> null
      - is_hns_enabled                     = false -> null
      - large_file_share_enabled           = false -> null
      - local_user_enabled                 = true -> null
      - location                           = "uksouth" -> null
      - min_tls_version                    = "TLS1_2" -> null
      - name                               = "ingest02zcuttingsbox" -> null
      - nfsv3_enabled                      = false -> null
      - primary_access_key                 = (sensitive value) -> null
      - primary_blob_connection_string     = (sensitive value) -> null
      - primary_blob_endpoint              = "https://ingest02zcuttingsbox.blob.core.windows.net/" -> null
      - primary_blob_host                  = "ingest02zcuttingsbox.blob.core.windows.net" -> null
      - primary_connection_string          = (sensitive value) -> null
      - primary_dfs_endpoint               = "https://ingest02zcuttingsbox.dfs.core.windows.net/" -> null
      - primary_dfs_host                   = "ingest02zcuttingsbox.dfs.core.windows.net" -> null
      - primary_file_endpoint              = "https://ingest02zcuttingsbox.file.core.windows.net/" -> null
      - primary_file_host                  = "ingest02zcuttingsbox.file.core.windows.net" -> null
      - primary_location                   = "uksouth" -> null
      - primary_queue_endpoint             = "https://ingest02zcuttingsbox.queue.core.windows.net/" -> null
      - primary_queue_host                 = "ingest02zcuttingsbox.queue.core.windows.net" -> null
      - primary_table_endpoint             = "https://ingest02zcuttingsbox.table.core.windows.net/" -> null
      - primary_table_host                 = "ingest02zcuttingsbox.table.core.windows.net" -> null
      - primary_web_endpoint               = "https://ingest02zcuttingsbox.z33.web.core.windows.net/" -> null
      - primary_web_host                   = "ingest02zcuttingsbox.z33.web.core.windows.net" -> null
      - public_network_access_enabled      = true -> null
      - queue_encryption_key_type          = "Service" -> null
      - resource_group_name                = "ingest02-main-sbox" -> null
      - secondary_access_key               = (sensitive value) -> null
      - secondary_connection_string        = (sensitive value) -> null
      - sftp_enabled                       = false -> null
      - shared_access_key_enabled          = true -> null
      - table_encryption_key_type          = "Service" -> null
      - tags                               = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "environment"  = "sandbox"
        } -> null
        # (56 unchanged attributes hidden)

      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
            # (1 unchanged attribute hidden)
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }
    }

  # local_file.config["00"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "sbox"
              + lz  = "00"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_sbox_00.json"
      + id                   = (known after apply)
    }

  # local_file.config["01"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "sbox"
              + lz  = "01"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_sbox_01.json"
      + id                   = (known after apply)
    }

  # local_file.config["02"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "sbox"
              + lz  = "02"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_sbox_02.json"
      + id                   = (known after apply)
    }

Plan: 3 to add, 0 to change, 24 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":163,"Program":"tfcmt","SHA1":"","Target":"1112: sbox_aria - Terraform Plan Apply","Vars":{}} -->